Tekla Open API Reference for Tekla Structures 2025
Filter Constructor (FilterExpression)
 Initializes a new instance of the Filter class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Filter(
	FilterExpression FilterExpression
)
Public Sub New (
	FilterExpression As FilterExpression
)
Parameters
FilterExpression
Type: Tekla.Structures.Filtering.FilterExpression
The FilterExpression object to be generated.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when a null FilterExpression is specified.
See Also
Reference
Filter Class
Filter Overload
Tekla.Structures.Filtering Namespace